Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/runsc/nginx/target_count_21/repeat_13/6.txt
2020/01/16 04:23:58 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8006/
2020/01/16 04:24:28 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 17904 requests
Server Software:        nginx/1.17.7
Server Hostname:        192.168.3.100
Server Port:            8006
Document Path:          /
Document Length:        612 bytes
Concurrency Level:      100
Time taken for tests:   30.012 seconds
Complete requests:      17904
Failed requests:        0
Total transferred:      15128880 bytes
HTML transferred:       10957248 bytes
Requests per second:    596.56 [#/sec] (mean)
Time per request:       167.628 [ms] (mean)
Time per request:       1.676 [ms] (mean, across all concurrent requests)
Transfer rate:          492.28 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  28.4      1    1036
Processing:     2  161  95.0    176    1251
Waiting:        1  156  93.9    170    1251
Total:          4  166  99.6    182    1254
Percentage of the requests served within a certain time (ms)
  50%    182
  66%    213
  75%    224
  80%    231
  90%    253
  95%    271
  98%    295
  99%    311
 100%   1254 (longest request)
{"connect":{"max":1036,"mean":5,"median":1,"min":0,"stdDev":28.399999618530273},"percentiles":{"100":1254,"50":182,"66":213,"75":224,"80":231,"90":253,"95":271,"98":295,"99":311},"processing":{"max":1251,"mean":161,"median":176,"min":2,"stdDev":95},"total":{"max":1254,"mean":166,"median":182,"min":4,"stdDev":99.5999984741211},"waiting":{"max":1251,"mean":156,"median":170,"min":1,"stdDev":93.9000015258789}}
2020/01/16 04:24:28 Matched stat line [Connect:        0    5  28.4      1    1036 Connect 0 5 28.4 1 1036]
2020/01/16 04:24:28 Matched stat line [Processing:     2  161  95.0    176    1251 Processing 2 161 95.0 176 1251]
2020/01/16 04:24:28 Matched stat line [Waiting:        1  156  93.9    170    1251 Waiting 1 156 93.9 170 1251]
2020/01/16 04:24:28 Matched stat line [Total:          4  166  99.6    182    1254 Total 4 166 99.6 182 1254]
2020/01/16 04:24:28 Matched percentline [  50%    182 50 182]
2020/01/16 04:24:28 Matched percentline [  66%    213 66 213]
2020/01/16 04:24:28 Matched percentline [  75%    224 75 224]
2020/01/16 04:24:28 Matched percentline [  80%    231 80 231]
2020/01/16 04:24:28 Matched percentline [  90%    253 90 253]
2020/01/16 04:24:28 Matched percentline [  95%    271 95 271]
2020/01/16 04:24:28 Matched percentline [  98%    295 98 295]
2020/01/16 04:24:28 Matched percentline [  99%    311 99 311]
2020/01/16 04:24:28 Matched percentline [ 100%   1254 100 1254]